let a = 1;
let b = 2;
let c = 3;
console.log('a=' + a + ', b=' + b + ', c=' + c);
let [d, e, f] = [4, 5, 6];//  ES6为变量赋值新方法,属于模式匹配
console.log('d=' + d + ', e=' + e + ', f=' + f);
/** ***************************************************** */
let [head, ...foot] = [1, 2, 3, 4];// 模式匹配:只要等号两边的模式相同，左边的变量就会被赋予对应的值。
let [x, y, ...z] = ['a'];
console.log('head = ' + head + ', foot =' + foot);
console.log('x = ' + x + ', y =' + y + ', z = ' + z);// x=a,y=undefined,z=空
/** ***************************************************** */
